Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Although in early versions of Perl, an undefined scalar could become defined when first used in a place expecting a defined value, this no longer happens except for rare cases of autovivification as explained in L<perlref>.
es_es: Aunque en las versiones anteriores de Perl, un escalar no definido podía llegar a ser definido la primera vez que se usaba en cualquier lugar que esperase un valor definido, esto no va a ocurrir más, excepto en los raros casos de "autovivificación" que se explican en L<perlref>.

source: B<Binary strings>, or B<byte strings> are made of bytes.
es_es: Las B<cadenas binarias> (o B<cadenas de bytes>) están constituidas por bytes.

source: Symbol table entries can be named with an initial '*', but you don't really care about that yet (if ever :-).
es_es: Las entradas de la tabla de símbolos pueden nombrarse empezando por '*', aunque no hace falta que se preocupe por esto ahora (y quizá nunca deba hacerlo :-).

source: Note that it's possible to confuse Perl into thinking C<//> (the empty regex) is really C<//> (the defined-or operator).
es_es: Tenga en cuenta que es posible confundir a Perl haciéndolo creer que C<//> (la expresión regular vacía) es en realidad C<//> (el operador definido-o).

source: You should use Perl's "plain old documentation" (POD) for your general technical documentation, though you may wish to write additional documentation (white papers, tutorials, etc) in some other format.
es_es: Debe usar "documentación simple y llana" de Perl (POD) para su documentación técnica en general, aunque es posible que desee escribir documentación adicional (papeles, manuales, etc) en algún otro formato.

source: Use C<rmdir> instead.
es_es: Utilice C<rmdir> en su lugar.

source: 9 mtime 9 bitmask @ARGV command line args
es_es: 9 mtime 9 máscara bits @ARGV args línea comandos

source: They're more readable than the C-style operators, but have different precedence to C<&&> and friends.
es_es: Ofrecen más legibilidad que los operadores tipo C correspondientes, como C<&&>, pero su precedencia es distinta.

source: The core always sets I<level> to 0 when it calls your function - the parameter is provided to allow your implementation to track depth if it needs to recurse.
es_es: El núcleo siempre pone <nivel> a 0 cuando se llama a la función - el parámetro es proporcionado para permitir su implementación para realizar un seguimiento profundo si es necesario que se llame a sí mismo.

source: This construct is very flexible and powerful.
es_es: Esta construcción es muy flexible y poderosa.

source: MSG must begin with the native long integer message type, be followed by the length of the actual message, and then finally the message itself.
es_es: MSG debe comenzar con un tipo de mensaje, contenido en un entero nativo largo, seguido por la longitud del mensaje, y finalmente el mensaje mismo.

source: show_year();
es_es: enseña_año();

source: Building with Borland's compilers on Win32 should work more smoothly.
es_es: Compilando con compiladores Borland en Win32 debería funcionar con más facilidad.

source: reset if eof; # reset ?pat?
es_es: reset if eof; # reinicia ?patrón?

source: But now, the only reasons to use C</o> are either:
es_es: Pero ahora, las únicas razones para utilizar C</o> son:

source: 1 ino 1 minute 1 filename $0 program name
es_es: 1 ino 1 minuto 1 nombre archivo $0 nombre programa

source: =head2 Installing the built perl on DG/UX
es_es: =head2 Instalando el perl compilado en DG/UX

source: The last component, if any (i.e. C<X>) is simply ignored.
es_es: El último componente, si existe (es decir, C<X>) es, simplemente, ignorado.

source: =item C<< (?P=NAME) >>
es_es: =item C<< (?P=NOMBRE) >>

source: Platform-specific pieces of the build system also live in platform-specific directories like F, F<vms/>, etc.
es_es: Las partes del sistema de compilación que son específicas de la plataforma se encuentran en directorios específicos de plataforma, como F, F<vms/>, etc.

source: Perl's licensing terms are also more open than GNU software's tend to be.
es_es: Los términos de la licencia de Perl también son más flexibles en general que los de las licencias de software GNU.

source: Modules shipped as part of the Perl core live in four subdirectories.
es_es: Los módulos distribuidos como parte del núcleo de Perl se encuentran en cuatro subdirectorios.

source: See L<perlop/"`STRING`"> and L</exec> for details.
es_es: Ver L<perlop/"`STRING`"> y L</exec> para más detalles.

source: perllinux Perl notes for Linux
es_es: perllinux Notas para Linux

source: $on_a_tty = -t STDIN && -t STDOUT;
es_es: $en_un_tty = -t STDIN && -t STDOUT;

source: Currently the following new features are available: C<switch> (adds a switch statement), C<~~> (adds a Perl 6-like smart match operator), C<say> (adds a C<say> built-in function), and C<err> (adds an C<err> keyword).
es_es: En la actualidad, están disponibles las siguientes nuevas características: C<switch> (añade una instrucción switch), C<~~> (añade un operador Perl 6 de emparejamiento inteligente), C<say> (añade una función incorporada C<say>), y C<err> (añade una palabra clave C<err>).

source: Also, case-insensitive matching works on the full set of Unicode characters.
es_es: Además, el sistema de coincidencia, insensible al tamaño de caja, funciona en el conjunto de caracteres Unicode.

source: Raises an exception if truncate isn't implemented on your system.
es_es: Lanza una excepción si truncate no está implementada en el sistema.

source: Note that this is quite safe and will not produce an endless loop, since C<__WARN__> hooks are not called from inside one.
es_es: Tenga en cuenta que esto es bastante seguro y no producirá un bucle sin fin, puesto que los enganches C<__WARN__> no son llamados desde el interior de uno mismo.

source: The customary Unix meaning of C<\1> is kludged in for C<s///>.
es_es: El significado Unix habitual de C<\1> es chapuceado dentro de C<s///>

source: our $bar; # declares $Foo::bar for rest of lexical scope
es_es: our $bar; # declara $Foo::bar para el resto del ámbito léxico

source: Imports some semantics into the current package from the named module, generally by aliasing certain subroutine or variable names into your package.
es_es: Importa semántica en el paquete actual desde el módulo que se indica, generalmente por medio de alias de ciertas subrutinas o nombres de variables en su paquete.

source: binmode(SOCKET, ":utf8") only worked on the input side, not on the output side of the socket.
es_es: binmode(SOCKET, ":utf8") solo funciona en el lado de la entrada, no en la salida del I<socket>.

source: POD documentation
es_es: Documentación POD

source: Similarly, grep returns aliases into the original list, much as a for loop's index variable aliases the list elements.
es_es: Semejantemente, grep devuelve alias de la lista original, como los alias de los elementos de la lista de las variables de los bucles for.

source: warn "not a C float"
es_es: warn "no es flotante en C"

source: (Unlike normal C<open>, the first argument is I<not> a filehandle, even though it looks like one).
es_es: (A diferencia de un C<open> normal, el primer argumento I<no> es un identificador de archivo, aunque lo parezca).

source: by Sam Tregar
es_es: Sam Tregar

source: When using ExtUtils::MakeMaker this will usually be:
es_es: Cuando se utiliza ExtUtils::MakeMaker serán algo así:

source: @args = ("command", "arg1", "arg2");
es_es: @args = ("comando", "arg1", "arg2");

source: Shortening an array this way destroys intervening values.
es_es: Acortar un array de esta forma destruye los valores involucrados.

source: The use of C<\K> inside of another look-around assertion is allowed, but the behaviour is currently not well defined.
es_es: El uso de C<\K> dentro de otra aserción consiguiente está permitida, pero el comportamiento no está, actualmente, bien definido.

source: LABEL while (EXPR) BLOCK continue BLOCK
es_es: ETIQUETA while (EXPR) BLOQUE continue BLOQUE

source: =head2 Known Problems with Perl on Hurd
es_es: =head2 Problemas conocidos de Perl sobre Hurd

source: Here, you don't have characters, just bytes.
es_es: Contienen bytes, no caracteres.

source: ISBN 978-0-201-65788-3 [2 edition, October 1999]
es_es: ISBN 978-0-201-65788-3 [2ª edición - Octubre de 1999]

source: (Note that this is I<NOT> true in C<eval{}>, C<sub{}>, or contrary to popular belief C<do{}> blocks, which do I<NOT> count as loops.) The C<continue> block is optional.
es_es: (Note que esto I<NO> es verdad en C<eval{}>, C<sub{}>, y contrariamente a la creencia popular, bloques C<do{}>, que I<NO> cuentan como bucles). El bloque C<continue> es opcional.

source: but doesn't spit out extra fields.
es_es: pero no escupe campos extra.

source: (The Perl compiler suite as a whole continues to be experimental.)
es_es: (El paquete del compilador de Perl, en su conjunto, sigue siendo experimental.)

source: Give more meaningful error messages from C<if> when invoked with a condition in list context.
es_es: Da mensajes de error más significativos cuando se invoca C<if> con una condición en contexto de lista.

source: This is also how it should always have been done: letting the Perl_-less forms to leak from the core was an accident.
es_es: Esta también es la forma en que siempre se debería haber hecho: dejar que los formularios Perl agotasen el núcleo fue un accidente.

source: Just set the environment variable PERL_SIGNALS to C<unsafe>, and the old immediate (and unsafe) signal handling behaviour returns.
es_es: Sólo tiene que configurar la variable de entorno PERL_SIGNALS a C<unsafe>, e inmediatamente el antiguo (y peligroso) comportamiento de la gestión de señales volverá.

source: But if you ask this question of someone who isn't a computer scientist, they might tell you that a I<program> has been compiled to physical machine code once and can then be run multiple times, whereas a I<script> must be translated by a program each time it's used.
es_es: Pero si hace esta pregunta a alguien que no es un científico de computación, pueden decirle que un I<programa> se compila para generar código máquina físico que se puede ejecutar repetidamente, mientras que un I<script> debe ser traducido por un programa cada vez que se ejecuta.

source: Currently there are no known holes in C<suidperl>, but previous experience shows that we cannot be confident that these were the last.
es_es: Actualmente no hay ningún agujero conocido en C<suidperl>, pero la experiencia anterior muestra que no podemos estar seguros de que estos fueron los últimos.

source: C<n>, C<N>, C<v> and C<V> accept the C<!> modifier to represent signed 16-/32-bit integers in big-/little-endian order.
es_es: C<n>, C<N>, C<v> y C<V> aceptan el modificador C<!> para representar enteros de 16-/32-bit con signo en distinta ordenación de bytes.

source: And if L<C<S<use encoding>>|encoding> is in effect, the number is considered to be in that encoding, and is translated from that into the platform's native encoding if there is a corresponding native character; otherwise to Unicode.
es_es: Y si L<C<S<use encoding>>|encoding> está activo, el número es considerado que está en esa codificación, y es traducido en la codificación nativa de la plataforma si existe un carácter local correspondiente; de lo contrario, es traducido a Unicode.

source: Therefore a C</> terminates a C<qq//> construct, while a C<]> terminates C<qq[]> and C<qq]]> constructs.
es_es: Por lo tanto, una C</> termina una construcción C<qq//>, mientras que un C<]> termina las construcciones C<qq[]> y C<qq]]>.

source: Although not for the faint of heart, Perl does support a C<goto> statement.
es_es: Aunque no sea muy querido, Perl soporta la instrucción C<goto>.

source: This is just a selected list of some of the more notable changes.
es_es: Esto es sólo una selección de algunos de los cambios más notables.

source: The experimental versions may include features that don't make it into the stable versions, and have an odd number as the minor release (i.e. perl5.9.x, where 9 is the minor release).
es_es: Las versiones experimentales pueden incluir características que no se incluyen en las versiones estables; en este caso el número de versión secundaria es un número impar (p. ej., perl5.9.x, donde 9 es la versión secundaria).

source: We see this as the lesser of two evils.
es_es: Vemos esto como el menor de dos males.

source: The precedence is a little lower than || and &&.
es_es: La precedencia es un poco menor que || y &&.

source: Notice that "hello" is only printed once, as when Perl sees that the sixth iteration of the outermost C<(?:)*> matches a zero-length string, it stops the C<*>.
es_es: Tenga en cuenta que "hola" sólo se imprime una vez, ya que cuando Perl ve la sexta iteración del C<(?:)*> más exterior coincide con una cadena de longitud cero, detiene a C<*>.

source: =head2 Scoping of the C<sort> pragma
es_es: =head2 Ámbito del pragma C<sort>

source: The L<File::stat> module provides a convenient, by-name access mechanism:
es_es: El módulo <File::stat> proporciona un conveniente mecanismo de acceso por nombre:

source: \b Match a word boundary
es_es: \b Coincide con un límite de palabra

source: On some systems, a value of 0 indicates that there are processes still running.
es_es: En algunos sistemas, un valor de 0 indica que hay procesos en funcionamiento.

source: That's because the C<(?!foo)> is just saying that the next thing cannot be "foo"--and it's not, it's a "bar", so "foobar" will match.
es_es: Esto es así porque C<(?!foo)> está diciendo que la siguiente cosa no puede ser "foo", y no lo es, es "bar", por lo que "foobar" sí que coincidirá.

source: In C<< native floating point --> native integer >> conversions the magnitude of the result is less than or equal to the magnitude of the source.
es_es: En las conversiones C<< punto flotante nativo --> entero nativo >>, la magnitud del resultado es menor o igual que la magnitud del número de origen.

source: The last two would be the $0 and the $s variables in the (presumably) non-existent package C<who>.
es_es: La última sería una variable $0 en un (presumiblemente) inexistente paquete C<quien>.

source: ISBN 978-0-596-52812-6 [3rd edition August 2006]
es_es: ISBN 978-0-596-52812-6 [3ª edición - Agosto de 2006]

source: You can browse and search the Perl 5 bugs at F<http://bugs.perl.org/>.
es_es: Puede navegar y buscar por los errores de Perl 5 en F<http://bugs.perl.org/>.

source: You can't disambiguate that by saying C<\{1}000>, whereas you can fix it with C<${1}000>.
es_es: No puede eliminar la ambigüedad diciendo C<\{1}000>, mientras que lo puede arreglar con C<${1}000>.

source: For string conversions, specifying a precision truncates the string to fit the specified width:
es_es: Para las conversiones de cadena, especificando una precisión trunca la cadena a la anchura especificada:

source: So you write this:
es_es: Así que escribe esto:

source: $@%&* dereference $$foo{bar} aka $foo->{bar}
es_es: $@%&* resolver referencia $$foo{bar} equivale a $foo->{bar}

source: A problem where the state of the regexp engine would sometimes get clobbered when running under the debugger has been fixed.
es_es: Un problema donde el estado del motor de expresiones regulares, algunas veces, se sobrecargaba cuando se ejecutaba en el depurador, se ha solucionado.

# die "Semaphore trouble: $! " unless semop($semid, $semop);
source: die "Semaphore trouble: $!\n" unless semop($semid, $semop);
es_es: die "Problema son semáforo: $!\n" unless semop($semid, $semop);

source: You should also try to ask people who are already familiar with the module's application domain and the CPAN naming system.
es_es: También debería tratar de pedir a las personas que ya están familiarizadas con el dominio de aplicación del módulo y el sistema de nombres de CPAN.

source: C<IO> upgraded to version 1.22
es_es: C<IO> actualizado a la versión 1.22

source: =item Double Quotes
es_es: =item Dobles comillas

source: In other systems like OS/2, DOS, and the various flavors of MS-Windows, your program sees a C<\n> as a simple C<\cJ>, but what's stored in text files are the two characters C<\cM\cJ>.
es_es: En otros sistemas como OS/2, DOS y los distintos sabores de MS-Windows, tu programa ve un C<\n> como un simple C<\cJ>, pero es almacenado en los archivos de texto como los dos caracteres C<\cM\cJ>.

source: It bypasses buffered IO, so mixing this with other kinds of reads, C<print>, C<write>, C<seek>, C<tell>, or C<eof> can cause confusion because the perlio or stdio layers usually buffers data.
es_es: Omite E/S con búfer, por lo que mezclar esto con otros tipos de lecturas, C<print>, C<write>, C<seek>, C<tell>, o C<eof> puede causar confusión porque las capas Perlio o stdio por lo general usan búfer de datos.

source: . Null-fill or truncate to absolute position specified by the value.
es_es: . Relleno con nulos o truncado a una posición absoluta especificada por el valor.

source: It formats (see L<perlform>) a list of values according to the contents of PICTURE, placing the output into the format output accumulator, C<$^A> (or C<$ACCUMULATOR> in English).
es_es: Formatea (ver L<perlform>) una lista de valores de acuerdo a los contenidos de CUADRO, colocando la salida en el acumulador de salida de format, C<$^A> (o C<$ACCUMULATOR> en English).

source: The following things B<might> happen in future.
es_es: Las siguientes cosas B<pueden> suceder en el futuro.

source: You can use this to break up your regular expression into (slightly) more readable parts.
es_es: Puede usar esto para romper la expresión regular en partes (un poco) más legibles.

source: C<IPC::Open3> upgraded to version 1.02
es_es: C<IPC::Open3> actualizado a la versión 1.02

source: =head2 Preamble
es_es: =head2 Preámbulo

source: While not quite all Perl 4 scripts run flawlessly under Perl 5, an update to perl should nearly never invalidate a program written for an earlier version of perl (barring accidental bug fixes and the rare new keyword).
es_es: Aunque no todos los scripts de Perl 4 se ejecutan sin errores en Perl 5, una actualización de perl no invalidará casi nunca un programa escrito para una versión anterior de perl (salvo correcciones de errores accidentales o una palabra clave nueva).

source: The collected standard output of the command is returned.
es_es: Todo lo que salga por la salida estándar del comando se devuelve.

source: A unary operator generally provides scalar context to its argument, while a list operator may provide either scalar or list contexts for its arguments.
es_es: Un operador unario generalmente proveé de un contexto escalar a su argumento, mientras que un operador de listas puede proveer tanto de un contexto escalar o de un contexto de lista, a sus argumentos.

source: So
es_es: Así que

source: Both failures are not really specific to the Hurd, as indicated by the test suite output.
es_es: En realidad, estos errores no son específicos de Hurd (como parece indicar el resultado del conjunto de pruebas).

source: $perl_info = qx(ps $$); # that's Perl's $$
es_es: $perl_info = qx(ps $$); # es el $$ de Perl

source: As a side effect, calling values() resets the HASH or ARRAY's internal iterator; see L</each>.
es_es: Como efecto colateral, llamando a values() reinicia el iterador interno del HASH o ARRAY; vea L</each>.

source: refers to the collection of files distributed by the Copyright Holder, and derivatives of that collection of files created through textual modification.
es_es: se refiere a la colección de archivos distribuidos por el Titular del Copyright, y derivados de esa colección de archivos creados mediante la modificación del texto.

source: Thus, a reasonably portable way to find out the home directory might be:
es_es: Por lo tanto, un forma razonablemente portátil para averiguar el directorio principal podría ser:

source: open(INPUT, 'foo') # get sort's results
es_es: open(INPUT, 'foo') # obtener los resultado de sort

source: Quantifiers can be used to specify how many of the previous thing you want to match on, where "thing" means either a literal character, one of the metacharacters listed above, or a group of characters or metacharacters in parentheses.
es_es: Los cuantificadores se utilizan para especificar cuántas coincidencias de lo anterior (un carácter literal, uno de los metacaracteres antes especificados o un grupo de caracteres o metacaracteres entre paréntesis) se desea detectar.

source: Hopefully the contents of each of the filters should be self-explanatory.
es_es: El contenido de cada filtro debe ser autodescriptivo.

source: perlbook - Books about and related to Perl
es_es: perlbook - Libros sobre Perl y otros libros relacionados

source: Each result bit is based on the least-significant bit of the corresponding input character, i.e., on C<ord($char)%2>.
es_es: Cada bit resultante se basa en el bit menos significativo del correspondiente carácter de la entrada, es decir, en C<ord($carácter)%2>.

source: # process argument list of files along with any includes
es_es: # procesa la lista de archivos pasados como argumentos junto con cualquier archivo a incluir

source: s/^([^ ]*) *([^ ]*)/$2 $1/; # swap first two words
es_es: s/^([^ ]*) *([^ ]*)/$2 $1/; # intercambia las dos primeras palabras

source: Even if C<die> won't do what you want (say, in a CGI script, where you want to format a suitable error message (but there are modules that can help with that problem)) always check the return value from opening a file.
es_es: Incluso si C<die> no hace lo que usted quiere (por ejemplo, en un script CGI, en la que desea dar formato a un mensaje de error apropiado (aunque existen módulos que pueden ayudar con ese problema)) controle siempre el valor de retorno de la apertura de un archivo.

source: =item (<NAME>) ('NAME')
es_es: =item (<NOMBRE>) ('NOMBRE')

source: The similarity to the title of the major Perl book (which came later) is not completely accidental:
es_es: La similitud con el título de libro principal de Perl (que se publicó posteriormente) no es totalmente accidental:

source: the value of the last evaluated expression of the C<given> block if no condition is true.
es_es: el valor de la última expresión evaluada del bloque C<given>, si ninguna condición es verdadera.

source: results in C<< <><b><><a><><r><> >>.
es_es: resulta en C<< <><b><><a><><r><> >>.

source: This program is free software; you can redistribute it and/or modify it under the terms of either:
es_es: Este programa es software libre; puede redistribuirlo y/o modificarlo bajo los términos de:

source: It is possible to stack multiple here-docs in a row:
es_es: Es posible apilar múltiples documentos incrustados en una fila:

source: printf '<%+ d>', 12; # prints "<+12>"
es_es: printf '<%+ d>', 12; # imprime "<+12>"

source: See L<overload>.
es_es: Ver L<sobrecarga>.

source: Even a one-word documentation patch should result in a change in version at the sub-minor level.
es_es: Incluso una revisión de documentación de una sola palabra debe dar lugar a un cambio en la versión de nivel más bajo.

source: $minutes = $2;
es_es: $minutos = $2;

source: =item C<(*THEN)> C<(*THEN:NAME)>
es_es: =item C<(*THEN)> C<(*THEN:NOMBRE)>

source: Makes C<shift;> 5% faster over C<shift @_;> on not threaded perl and 25% faster on threaded.
es_es: Hace a un C<shift;> un 5% más rápido que C<shift @_;> en un perl sin hebras y un 25% más rápido en uno con hebras.

source: # or just leave it undef to autoviv
es_es: # o simplemente dejarlo indefinido, para autovivificarlo

source: =item join EXPR,LIST X<join>
es_es: =item join EXPR,LISTA X<join>
